Ran Plan for project: `iam-user` dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.aws_iam_policy.readonly: Reading...
data.aws_iam_policy.readonly: Read complete after 0s [id=arn:aws:iam::aws:policy/ReadOnlyAccess]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_iam_user.poc_user will be created
+ resource "aws_iam_user" "poc_user" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "demo.user.003"
      + path          = "/"
      + tags          = {
          + "created_by" = "atlantis-poc"
        }
      + tags_all      = {
          + "created_by" = "atlantis-poc"
        }
      + unique_id     = (known after apply)
    }

  # aws_iam_user_policy_attachment.attach_ro will be created
+ resource "aws_iam_user_policy_attachment" "attach_ro" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/ReadOnlyAccess"
      + user       = "demo.user.003"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ created_user = "demo.user.003"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p iam-user
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://0f4347e08d18:4141/lock?id=shimulhumayun%252Fatlantis-iam-user-poc%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p iam-user
  ```
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```